# 字符串操作

# 字符串 + 操作
vara = '君不见，黄河之水天上来，奔流到海不复回；'
varb = '君不见，高堂明镜悲白发，朝如青丝暮成雪。'
res = vara + varb
print(res) # 君不见，黄河之水天上来，奔流到海不复回；君不见，高堂明镜悲白发，朝如青丝暮成雪。

# 字符串 * 操作
vars = '鸡'
print(vars * 5 + '你太美') # 鸡鸡鸡鸡鸡你太美

# 字符串[] 切片操作
# 字符串的索引操作，只能访问，不能修改
'''
0 1 2 34 5 6 7 8 9 10...
君不见，黄河之水天上来，奔流到海不复回；
                             ...-2-1
'''
vara = '君不见，黄河之水天上来，奔流到海不复回；'
print(vara[5]) # 河
print(vara[-5]) # 海

'''
[开始值: 结束值: 步长]
'''

print(vara[5:]) # 河之水天上来，奔流到海不复回；
print(vara[:5]) # 君不见，黄
print(vara[2:5]) # 见，黄
print(vara[::3]) # 君，之上奔海回
print(vara[::-2]) # ；复海流，上水河，不 # 先倒转过来，再每隔一个取一个
print(vara[::-1]) # ；回复不海到流奔，来上天水之河黄，见不君
